"use strict";
// Задача №1
// Що потрапить в консоль ?

//     let someVar = 0;
// ++someVar;

// if (someVar) {
//     console.log(someVar);
// }

// Задача №2
// За допомогою циклу FOR виведіть в консоль 10 рядків:
// Пункт №1
// Пункт №2
// і т.д.


//     Задача №3
// Що потрапить в консоль ?
// if (2 * 20 <= 10 || 30 / 2 < 5 && 10 <= "10" || 20 === "20") {
//     console.log('000');
// }

// Задача №4
// Створіть функцію, яка повертає результат ділення числа a на число b з додаванням рядка "Результат ділення: "
// Викличте функцію передаючі різні значення, у тому числі не передаючи зовсім.
// Функція не має повертати NaN, Infinite або помилку

// Задача №5
// Створіть масив даних - 5 елементів, один з яких число 10
// Обробіть масив за допомогою методу перебору
// Перевіряйте елемент на відповідність числу 10, та у разі відповідності, виводьте в консоль
// консоль потрапить 1, бо значення змінної  0, а оператор++ збільшує значення змінної на 1.                                                                  Задача  №2                                                           for (let i = 1; i <= 10; ++i) {
//     console.log(Пункт${ i })
// } Задача №3                                                                   40 <= 10 | | 15 < 5 && 10 <= 10 | | 20 === "20"
// false | | false && true | | false
// false | | false | | false
// false
//  Нічого не потрапить у консоль, бо умова не виконалась                                                                    Задача №4                                                                function divide(a, b) {
//     if (typeof a !== "number" || typeof b !== "number") {
//         return Результат ділення: некоректні дані;
//     }
//     if (b === 0) {
//         return Ділення на нуль неможливе;
//     }
//     return Результат ділення: ${ a / b };
// }

// console.log(divide(10, 2));
// console.log(divide(5, 0));
// console.log(divide(10));
// console.log(divide());
// console.log(divide("10", 2)); Задача №5                                                                                                                                                      let someArray = [5, true, "Sam", "Hello", 10]
// someArray.forEach((item) => {
//     if (item === 10) {
//         console.log(item);
//     }
// });